Packages/Utilities/Sources/Utilities/Resources/RequestBodyTemplates/item-details-request-body-template.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <GetCatalogueRecord xmlns="http://bibliomondo.com/websevices/webcatalogue">
            <ControlNumber></ControlNumber>
            <CatalogueNumber>%1$@</CatalogueNumber>
            <PRD></PRD>
            <ItemNumber></ItemNumber>
            <ATkey></ATkey>
            <Akey></Akey>
        </GetCatalogueRecord>
    </soap:Body>
</soap:Envelope>
